[
  {
    "id": "cmcracmy40000ovpgm0avuzf6",
    "name": "avant-garde lamp",
    "company": "Modenza",
    "type": "lamp",
    "areaOfUse": "lighting",
    "description": "Crafted from hand-blown smoked glass and brushed brass, this avant-garde lamp casts sculptural pools of warm light. Its asymmetrical design and integrated dimmer make it both a centerpiece and a functional reading light in modern interiors.",
    "featured": true,
    "image": "https://images.pexels.com/photos/943150/pexels-photo-943150.jpeg?auto=compress&cs=tinysrgb&w=1600",
    "price": 100
  },
  {
    "id": "cmcracn5o0001ovpglahonz1p",
    "name": "chic chair",
    "company": "Luxora",
    "type": "chair",
    "areaOfUse": "seating",
    "description": "Upholstered in premium velvet with a gentle curve backrest and slender gold-tone legs, this chair blends mid-century elegance with modern comfort. Perfect for a vanity, bedside, or accent seat in your living room.",
    "featured": true,
    "image": "https://images.pexels.com/photos/5705090/pexels-photo-5705090.jpeg?auto=compress&cs=tinysrgb&w=1600",
    "price": 200
  },
  {
    "id": "cmcracn8y0002ovpgc3m9atzn",
    "name": "comfy bed",
    "company": "Homestead",
    "type": "bed",
    "areaOfUse": "sleeping",
    "description": "This queen-size platform bed features a softly padded upholstered headboard in durable linen-blend fabric. Built on a solid hardwood frame, it offers both supportive comfort and under-bed storage for a clutter-free bedroom.",
    "featured": true,
    "image": "https://images.pexels.com/photos/1034584/pexels-photo-1034584.jpeg?auto=compress&cs=tinysrgb&w=1600",
    "price": 300
  },
  {
    "id": "cmcracnca0003ovpgicbq7e88",
    "name": "contemporary sofa",
    "company": "Comfora",
    "type": "sofa",
    "areaOfUse": "seating",
    "description": "A sleek three-seater sofa upholstered in stain-resistant performance fabric. Slim track arms and low-profile legs give it an airy silhouette, while high-density foam cushions ensure long-lasting comfort.",
    "featured": false,
    "image": "https://images.pexels.com/photos/1571459/pexels-photo-1571459.jpeg?auto=compress&cs=tinysrgb&w=1600",
    "price": 400
  },
  {
    "id": "cmcracnfo0004ovpg7pwytdw8",
    "name": "wooden stool",
    "company": "FurniCraft",
    "type": "stool",
    "areaOfUse": "seating",
    "description": "A compact and sturdy wooden stool made from premium mango wood. Designed with a natural finish, this versatile piece fits seamlessly in kitchens, study corners, or as a plant stand. Lightweight yet durable, it's perfect for small spaces and everyday use.",
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/51eoKWxpEQL._AC_UL480_FMwebp_QL65_.jpg",
    "price": 329
  },
  {
    "id": "cmcracnj40005ovpgyagvs7i7",
    "name": "metal floor lamp",
    "company": "Luxora",
    "type": "lamp",
    "areaOfUse": "lighting",
    "description": "This sleek metal floor lamp features a matte black finish and a minimalist silhouette that complements any modern or industrial-style space. Equipped with an adjustable neck and energy-efficient LED compatibility, it's ideal for reading corners, living rooms, or workspaces.",
    "featured": true,
    "image": "https://m.media-amazon.com/images/I/818yDyo4ciL._AC_UL480_FMwebp_QL65_.jpg",
    "price": 899
  },
  {
    "id": "cmcracnma0006ovpg5evu3ng3",
    "name": "Wakefit Queen Size Bed",
    "company": "Wakefit",
    "type": "bed",
    "areaOfUse": "sleeping",
    "description": "Built for durability and comfort, the Wakefit Queen Size Bed features an engineered wood frame with a sleek walnut finish. Designed with a headboard and ample under-bed storage, it pairs perfectly with modern and minimalist bedrooms. Easy to assemble and built to last.",
    "featured": true,
    "image": "https://m.media-amazon.com/images/I/81ouFuSvc3L._SX425_.jpg",
    "price": 11999
  },
  {
    "id": "cmcracnpn0007ovpgifbr4bpv",
    "name": "Sofa-cum-Bed",
    "company": "UrbanStyle",
    "type": "sofa-bed",
    "areaOfUse": "seating & sleeping",
    "description": "This compact and versatile sofa-cum-bed is perfect for small apartments or guest rooms. Upholstered in soft, breathable fabric with a fold-out design, it easily transforms from a stylish two-seater into a cozy single bed. Ideal for modern urban living without compromising on comfort.",
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/81D+rLhAEbL._AC_UL480_FMwebp_QL65_.jpg",
    "price": 3800
  },
  {
    "id": "cmcracnsz0008ovpgd669eg1p",
    "name": "3-Tier Engineered Wood Storage",
    "company": "FurniCraft",
    "type": "storage",
    "areaOfUse": "organization",
    "description": "This 3-tier storage unit is crafted from high-quality engineered wood, offering both style and functionality. With a sleek matte finish and compact vertical design, it’s perfect for organizing books, decor items, or office supplies. Ideal for bedrooms, living rooms, or study areas.",
    "featured": true,
    "image": "https://m.media-amazon.com/images/I/71I7MFJVIRL._AC_UL480_FMwebp_QL65_.jpg",
    "price": 1799
  },
  {
    "id": "cmcracnwb0009ovpgjbvftyzz",
    "name": "Inflatable Air Sofa",
    "company": "Comfora",
    "type": "sofa",
    "areaOfUse": "seating",
    "description": "Lightweight, portable, and incredibly comfortable, this inflatable air sofa is perfect for both indoor lounging and outdoor adventures. Made from durable, waterproof PVC material, it inflates in minutes and folds down to a compact size for easy storage and transport.",
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/61puZN7r1EL._AC_UL480_FMwebp_QL65_.jpg",
    "price": 2000
  },
  {
    "id": "cmcracnzo000aovpgcsf0750u",
    "name": "Cushion Lounge",
    "company": "CozyNest",
    "type": "lounge",
    "areaOfUse": "seating",
    "description": "Designed for ultimate relaxation, this cushion lounge features plush padding and ergonomic support. Upholstered in soft-touch fabric with a minimalist design, it’s perfect for reading, meditating, or adding a cozy touch to any corner of your home.",
    "featured": true,
    "image": "https://m.media-amazon.com/images/I/61Ljqgsat6L._AC_UL480_FMwebp_QL65_.jpg",
    "price": 1100
  },
  {
    "id": "cmcraco2z000bovpg320ebv6m",
    "name": "Wakefit Mattress",
    "company": "Wakefit",
    "type": "mattress",
    "areaOfUse": "sleeping",
    "description": "Wakefit’s mattress offers optimal support and comfort with its high-density foam, designed to provide a perfect balance between softness and firmness. Ideal for a restful night’s sleep, this mattress also comes with a 7-year warranty for peace of mind. The mattress contours to your body, ensuring a comfortable sleep throughout the night.",
    "featured": true,
    "image": "https://images-eu.ssl-images-amazon.com/images/I/9151tnEqRkL._AC_UL165_SR165,165_.jpg",
    "price": 6500
  },

  {
    "id": "baf6a3c6-f777-4448-824d-1915d9b29154",
    "name": "Hexagonal Side Table (Acacia Brown)",
    "type": "Side Table",
    "areaOfUse": "Living Room",
    "company": "SBF Furniture",
    "description": "Infuse your space with geometric elegance using this modern hexagonal side table. It features a striking tabletop with a rich, matte acacia brown finish that adds a touch of sophistication to any decor. The minimalist design is supported by a sturdy, three-legged base, ensuring excellent stability while maintaining an open, airy look. It's the perfect size to serve as an end table, a nightstand, or a chic stand for your favorite plant.",
    "price": 282.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/71PGhbQ-j1L._AC_UL320_.jpg"
  },
  {
    "id": "377921a2-272b-4e33-b568-0fb7f36d4220",
    "name": "Modern Wooden Side Table",
    "type": "Side Table",
    "areaOfUse": "Living Room",
    "company": "FireBees",
    "description": "This versatile side table is a master of functionality and style. Crafted from premium engineered wood with a smooth, contemporary finish, it's built to last. Its compact and space-saving design makes it an ideal choice for smaller rooms, apartments, or minimalist setups. Use it as a bedside stand for your lamp and books, a convenient sofa-side shelf for drinks, or a stylish corner table to display decor.",
    "price": 899.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/61xsbViddXL._AC_UL320_.jpg"
  },
  {
    "id": "c42d750d-4db0-4838-995d-b4d816d69548",
    "name": "Antique Foldable Wooden Table",
    "type": "Accent Table/Stool",
    "areaOfUse": "Living Room",
    "company": "UHUD CRAFTS",
    "description": "Add a touch of rustic charm with this beautifully handcrafted wooden table. Made from solid mango wood with an antique finish, it serves multiple purposes as a quaint side table, a sturdy plant stand, or even a convenient stool. Its best feature is the clever foldable design, allowing you to easily carry it anywhere or store it away compactly when not in use, making it a perfect and practical gift.",
    "price": 319.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/51eoKWxpEQL._AC_UL320_.jpg"
  },
  {
    "id": "163c54f7-2bf6-443f-aa21-0201263ca36b",
    "name": "Wall-Mounted Router & Set-Top Box Shelf",
    "type": "Wall Shelf",
    "areaOfUse": "Living Room",
    "company": "Dime Store",
    "description": "Declutter your entertainment area and achieve a clean, modern look with this wall-mounted shelf. Specifically designed to hold your set-top box and WiFi router, it frees up valuable floor space. The smart design includes provisions for easy cable management, hiding messy wires and keeping your setup organized. It’s a stylish and functional solution to elevate your living room decor.",
    "price": 229.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/71koXLKBP+L._AC_UL320_.jpg"
  },
  {
    "id": "dacde73f-7909-47fd-b8a3-2ef08541831d",
    "name": "Wall-Mounted C-Style TV Cabinet",
    "type": "TV Cabinet",
    "areaOfUse": "Living Room",
    "company": "Tanu Craft",
    "description": "Elevate your TV viewing experience with this modern C-style wall-mounted cabinet. The sophisticated two-tone finish of dark wenge and wisdom white blends seamlessly into contemporary interiors. Its floating design creates a spacious feel while providing ample storage for media players, game consoles, and decor. Built for TVs up to 32 inches, it’s a perfect centerpiece for your entertainment space.",
    "price": 1449.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/610GhgEG6pL._AC_UL320_.jpg"
  },
  {
    "id": "8836cf4f-b7ee-4393-a4bd-ab37167e0ce6",
    "name": "Hexagonal Floating Wall Shelves (Set of 6)",
    "type": "Wall Shelf",
    "areaOfUse": "Living Room",
    "company": "AR SABRI SHOPEE",
    "description": "Transform any plain wall into a stunning focal point with this set of 6 hexagonal floating shelves. The modern honeycomb design allows for endless creative arrangements, letting you build a personalized geometric display. These shelves are a fantastic space-saving solution for showcasing small plants, photo frames, collectibles, and other decorative treasures, adding depth and personality to your room.",
    "price": 986.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/61k4xgGFFKL._AC_UL320_.jpg"
  },
  {
    "id": "edc78728-5ae8-4221-8bf4-1a08f2912648",
    "name": "Foldable Multipurpose Laptop Table",
    "type": "Laptop Table",
    "areaOfUse": "Home Office",
    "company": "TORT",
    "description": "Experience ultimate convenience whether you're working from home or relaxing. This portable laptop table features a sturdy steel frame and an ergonomic, curved tabletop for comfortable use. It includes dedicated slots for a cup and a tablet, keeping your essentials secure. Its lightweight and foldable design means you can easily move it from the bed to the sofa or even take it outdoors. Best of all, it comes fully assembled and ready to use right out of the box.",
    "price": 229.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/71qZl8y-t6L._AC_UL320_.jpg"
  },
  {
    "id": "40c8cca5-3f22-43b8-a4f0-4a7df5c68f84",
    "name": "Wall-Mounted Mirrored Storage Cabinet",
    "type": "Cabinet",
    "areaOfUse": "Bathroom",
    "company": "Happer",
    "description": "This wall cabinet is the perfect fusion of style and practicality for your bathroom. It features a high-quality, smudge-free mirror on the front and opens up to reveal a spacious storage area. Made from highly durable virgin PPCP plastic, it’s designed to withstand humid conditions. The deep compartments offer plenty of room to organize toiletries, cosmetics, and medicines, keeping your countertops clutter-free.",
    "price": 999.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/61VxgYs6feL._AC_UL320_.jpg"
  },
  {
    "id": "688e05c1-7166-46f1-8278-eda4a62232b4",
    "name": "Self-Adhesive Organizer Shelf",
    "type": "Organizer Shelf",
    "areaOfUse": "Bathroom",
    "company": "THE SR BRAND",
    "description": "Instantly create more storage space without any tools or damage to your walls. This shelf uses a powerful self-adhesive backing that mounts securely to any smooth surface. Its modern black design is perfect for organizing bathroom toiletries, kitchen spices, or small office supplies. Crafted from durable, rust-proof plastic, this shelf is a simple, stylish, and damage-free solution for any room.",
    "price": 249.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/71EtSX+PakL._AC_UL320_.jpg"
  },
  {
    "id": "af78fcda-736c-47f9-8eee-9429ec438fec",
    "name": "Zig-Zag Corner Wall Shelf (Set of 5)",
    "type": "Wall Shelf",
    "areaOfUse": "Living Room",
    "company": "Dime Store",
    "description": "Make the most of your space with this clever set of 5 corner shelves. The unique zig-zag design transforms unused corners into a functional and eye-catching display area. Crafted from engineered wood with a sleek, glossy white finish, it adds a touch of modern sophistication. It’s the perfect perch for your favorite books, small plants, and decorative items, adding architectural interest to any room.",
    "price": 599.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/710id8okAyL._AC_UL320_.jpg"
  },
  {
    "id": "408981b9-9b1a-4965-b0d1-0df5f2018535",
    "name": "Modern Upholstered Entryway Bench",
    "type": "Bench/Ottoman",
    "areaOfUse": "Entryway",
    "company": "ObalTure",
    "description": "This upholstered bench offers a touch of luxury and comfort the moment you walk in. The plush blue corduroy fabric is soft to the touch, while the sturdy metal frame provides robust support. Its incredible versatility makes it a perfect welcoming seat in an entryway, a chic ottoman in the living room, or a sophisticated accent piece at the foot of your bed, effortlessly blending style and function.",
    "price": 3149.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/61VeyMP3gwL._AC_UL320_.jpg"
  },
  {
    "id": "4b33b4b8-d20a-40bf-ab31-eea1502a4955",
    "name": "4-Layer Metal Kitchen Trolley",
    "type": "Kitchen Trolley",
    "areaOfUse": "Kitchen",
    "company": "Rasvesh",
    "description": "Bring superior organization to your kitchen with this 4-layer metal trolley. It features unique rotating baskets that swing out for easy access from any angle, so you can grab what you need without hassle. The trolley moves smoothly on 360-degree caster wheels, which can be locked for stability. It's an ideal storage solution for fruits, vegetables, spices, and pantry items, keeping your kitchen tidy.",
    "price": 2359.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/51X4l+x8tNL._AC_UL320_.jpg"
  },
  {
    "id": "a561e875-28e2-448d-9146-a31fb72c42f0",
    "name": "Adjustable Wooden Coat Stand",
    "type": "Coat Stand",
    "areaOfUse": "Entryway",
    "company": "ABOUT SPACE",
    "description": "Keep your entryway neat and organized with this highly practical coat stand. Its clever modular design is detachable, allowing you to set it at three different heights to suit the needs of both adults and children. Equipped with 8 rounded hooks, it provides ample space for coats, hats, bags, and umbrellas. The sturdy, wide triangular base ensures it remains stable and won't tip over, even when fully loaded.",
    "price": 1168.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/71jnr-TotqL._AC_UL320_.jpg"
  },
  {
    "id": "de9dc083-5620-45c3-9ebb-f695e5fd0309",
    "name": "Inflatable Lounge Chair & Footstool Set",
    "type": "Inflatable Furniture",
    "areaOfUse": "Outdoor",
    "company": "LivTee",
    "description": "Relax in ultimate comfort anywhere with this 2-in-1 inflatable lounge chair and footstool. The soft, flocked surface provides a luxurious, velvety feel for hours of lounging. It’s incredibly portable and includes an air pump for quick inflation and deflation, making it perfect for camping trips, backyard relaxation, or as extra seating for guests during movie nights. Use it as a chair with an ottoman or combine them for a full lounge bed.",
    "price": 1999.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/510QCqyr9eL._AC_UL320_.jpg"
  },
  {
    "id": "ee12e0fa-9581-4e51-b29a-2bfd779ef192",
    "name": "Wall-Mounted TV Entertainment Unit",
    "type": "TV Cabinet",
    "areaOfUse": "Living Room",
    "company": "Maaz Art & Craft",
    "description": "This wall-mounted TV unit brings a clean, contemporary look to your living space. Its floating design creates an illusion of space and makes cleaning easier. It features multiple open shelves that are perfectly sized for your media devices, remote controls, and game consoles, while also offering room to display your favorite decorative accents. It's a stylish and practical way to organize your entertainment setup.",
    "price": 1149.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/71-dNLM2PSL._AC_UL320_.jpg"
  },
  {
    "id": "d193b4e2-cc47-43b7-a328-27b40bf28b52",
    "name": "Adjustable Rope Hanging Shelf",
    "type": "Wall Shelf",
    "areaOfUse": "Living Room",
    "company": "UHUD CRAFTS",
    "description": "Embrace a touch of bohemian or rustic charm with this beautiful hanging shelf. A single wooden plank is suspended by natural fiber ropes, which can be easily adjusted to your desired length. It’s incredibly easy to install and is perfect for creating a mini vertical garden with succulents, displaying a cherished photo, or holding a small decorative vase. It adds a warm, personal, and natural element to any wall.",
    "price": 148.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/61I3xo6idhL._AC_UL320_.jpg"
  },
  {
    "id": "bb435074-e3fb-4c81-9f72-94b1c389bb15",
    "name": "Convertible Sofa Bed (3x6 ft)",
    "type": "Sofa Bed",
    "areaOfUse": "Living Room",
    "company": "Rosebell",
    "description": "This convertible sofa bed is the ultimate space-saving solution for modern living. With minimal effort, a single person can transform it from a comfortable sofa to a relaxing lounger or a flat single bed. It's perfect for accommodating overnight guests or for small apartments where space is at a premium. The stylish jute fabric cover is also removable and washable, ensuring it always looks fresh and inviting.",
    "price": 3795.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/81D+rLhAEbL._AC_UL320_.jpg"
  },
  {
    "id": "d396e5f5-1c78-475f-b013-664db1788d2b",
    "name": "Rocking Chair & Bench Cushion (18x50 Inch)",
    "type": "Cushion/Pad",
    "areaOfUse": "Indoor",
    "company": "Mom's Moon",
    "description": "Revitalize your favorite chair with this plush and comfortable cushion. Its generous, overstuffed construction provides an exceptional layer of coziness, and the tufted design ensures the fill stays evenly distributed for long-lasting support. This pad is perfect for adding much-needed comfort to a hard rocking chair, an outdoor patio bench, or a charming porch swing, making any seat the best seat in the house.",
    "price": 749.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/41xSNXKBXBL._AC_UL320_.jpg"
  },
  {
    "id": "05372b1b-b3f7-456c-a17c-fa6d9e1b73f8",
    "name": "Self-Adhesive Mini Caster Wheels (4-Pack)",
    "type": "Furniture Hardware",
    "areaOfUse": "General Use",
    "company": "UB Unity Brand",
    "description": "Make your household items mobile with this ingenious 4-pack of mini caster wheels. Featuring strong self-adhesive backing, they can be attached to almost any item without drilling. The 360-degree swivel balls allow for smooth, silent movement in any direction. Use them on storage bins, small appliances like coffee makers, trash cans, or flower pots to make moving and cleaning around them effortless.",
    "price": 243.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/61DTPOGBj1L._AC_UL320_.jpg"
  },
  {
    "id": "63d0f2e0-4832-4ab5-a9f7-134f64f456f6",
    "name": "Nesting Coffee Tables (Set of 2)",
    "type": "Coffee Table Set",
    "areaOfUse": "Living Room",
    "company": "NEST NATURE HAVEN",
    "description": "This set of two nesting tables is a statement in modern glamour. It combines the luxurious look of a white marble veneer top with a sleek and sturdy golden metal frame. The clever nesting design offers excellent flexibility – use them together for a layered look, or separate them for use as side tables when guests arrive. It's a space-saving and incredibly stylish addition to any living room or office.",
    "price": 2696.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/81bnrrd4x8L._AC_UL320_.jpg"
  },
  {
    "id": "72e28993-f970-4b8f-84cb-8a954074714b",
    "name": "Wooden Side Table / Nightstand",
    "type": "Side Table",
    "areaOfUse": "Bedroom",
    "company": "ABOUT SPACE",
    "description": "Meet the perfect companion for your bedside or sofa. This side table's clean lines and compact design make it a versatile piece for any room. It features a spacious top surface for a lamp or photos, and a lower open shelf for books and other essentials. Its practical design helps you stay organized while adding a touch of classic wooden style to your bedroom or living room decor.",
    "price": 999.0,
    "featured": false,
    "image": "https://m.media-amazon.com/images/I/81D5COIIatL._AC_UL320_.jpg"
  }
]
